[
  {
    "id": "mainRoot",
    "delay": 0,
    "text": "Hi William,\n\n ich habe mal wieder zu viele Fälle die ich gleichzeitig lösen muss. Du hast mir ja schonmal mit einem schwierigen Fall geholfen vielleicht kannst du diesen hier ja auch für mich lösen. Hier sind die relaventen Details die mein Team bisher gesammelt hat: Es geht um einen Mord durch Brandstiftung. Der Name des Opfers ist Markus Farber. Markus Farber war der Geschäftsführer von \"Farber Medical Industries\", einem Pharmaunternehmen. Er ist am 03.01.2020 bei dem Hausbrand in seinem Haus gestorben. Der Brand wurde um 20:07 von einem Nachbarn bemerkt und die Feuerwehr alarmiert. Durch den Löschvorgang wurde der Großteil der Spuren zunichte gemacht. Es hat sogar eine ganze Weile gedauert bis wir festgestellt haben dass dabei jemand gestorben ist. Die relevantesten Personen die wir bis jetzt zu dem Fall befragt haben sind Markus Farber's Frau Sophie und Steffan Wagenar, der CFO von Markus' Unternehmen. Sophie hat uns Zugriff auf das E-Mail Postfach ihres Mannes beschafft wo wir eine Droh-Mail gefunden haben. In dieser Mail wird Markus aufgefordert sich nicht weiter mit \"dem Thema\" zu befassen, ansonsten würden Konsequenzen folgen. Genauere Schlüsse konnten aus der Mail allerdings nicht gezogen werden. Interessant war allerdings eine weitere E-Mail von Steffan Wagenar an Markus Farber, die eine Aufforderung an Markus enthält, wieder zu Verstand zu kommen. Wir haben Steffan vorgeladen aber sind noch nicht dazu gekommen ihn zu Verhören. Wir sind gerade noch dabei die Mobilfunkdaten aller beteiligten Personen auszuwerten aber das kann noch eine Weile dauern. Du bekommst ne Nachricht von der IT-Abteilung wenn sie die Daten haben.",
    "answers": [
      {
        "text": "Stell zuerst eine Frage an Sophie Farber.",
        "targetId": "sophieFix"
      },
      {
        "text": "Stell zuerst eine Frage an Steffan Wagenar.",
        "targetId": "steffanFix"
      }
    ],
    "root": true,
    "chatName": "Herlock Sholmes",
    "chatImage": "/image/detectivemain.png",
    "unlockKeys": []
  },
  {
    "id": "sophieFix",
    "delay": 3,
    "text": "Alles klar ich hole Sophie zum Verhör. Warte kurz.",
    "answers": [
      {
        "targetId": "sophieMain"
      }
    ],
    "root": false,
    "unlockKeys": []
  },
  {
    "id": "steffanFix",
    "delay": 3,
    "text": "Alles klar ich hole Steffan zum Verhör. Warte kurz.",
    "answers": [
      {
        "targetId": "steffanMain"
      }
    ],
    "root": false,
    "unlockKeys": []
  },
  {
    "id": "sophieMain",
    "delay": 20,
    "text": "Wonach soll ich Sophie fragen?",
    "answers": [
      {
        "text": "Stell doch lieber eine Frage an Steffan Wagenar.",
        "targetId": "steffanMain",
        "lockedIf": {
          "condition": "evalTargetAnswerCountSmallerThan",
          "evalTargetId": "steffanMain",
          "data": 1
        }
      },
      {
        "text": "Frag mal nach möglichen Feinden von Markus Farber.",
        "targetId": "markusFeinde"
      },
      {
        "text": "Hat sich Markus Farber in letzter Zeit ungewöhnlich Verhalten?",
        "targetId": "markusVerhalten"
      },
      {
        "text": "Sophie hat angegeben, dass sie zur Tatzeit im Theater war aber die Mobilfunkdaten stimmen damit nicht überein. Sie scheint gelogen zu haben, konfrontiere sie doch mal damit.",
        "targetId": "sophieBreakdown",
        "locked": true,
        "unlockKey": "telefon"
      }
    ],
    "root": false,
    "unlockKeys": []
  },
  {
    "id": "markusFeinde",
    "delay": 13,
    "text": "Sie geht davon aus, dass Markus sicherlich einige Feinde hat, da sich dies als Firmenchef nicht vermeiden ließe. Allerdings weiß sie nichts genaueres und kann sich nicht vorstellen, dass jemand deshalb sein Haus anzünden würde.",
    "answers": [
      {
        "targetId": "sophieMain"
      }
    ],
    "root": false,
    "unlockKeys": []
  },
  {
    "id": "markusVerhalten",
    "delay": 16,
    "text": "Laut Sophie war Markus Farber in naher Vergangenheit sehr häufig mit seinem Unternehmen und des dazugehörigen Dokumenten beschäftigt. Deutlich häufiger als sonst.",
    "answers": [
      {
        "targetId": "sophieMain"
      }
    ],
    "root": false,
    "unlockKeys": []
  },
  {
    "id": "sophieBreakdown",
    "delay": 42,
    "text": "Das war eine sehr gute Idee! Sophie hatte einen Nervenzusammenbruch und hat gestanden ihren Mann umgebracht zu haben. Sie hat im Theater von ihrer Freundin erfahren, dass Markus sie betrogen hat. Daraufhin ist sie nach Hause gefahren um ihn zur Rede zu stellen und hat ihn dann im Affekt umgebracht.",
    "answers": [
      {
        "text": "Könnte es sein, dass sie Haus danach angezündet hat, um die Spuren zu verwischen?",
        "targetId": "sophieHausbrand"
      }
    ],
    "root": false,
    "unlockKeys": []
  },
  {
    "id": "sophieHausbrand",
    "delay": 12,
    "text": "Sie hat zwar gestanden ihn umgebracht zu haben, aber sagt der Hausbrand habe nichts mit ihr zu tun. Sie klingt dabei sehr glaubwürdig wenn du mich fragst. Sie ist in keiner Verfassung in der sie es jetzt noch abstreiten würde wenn sie den Brand tatsächlich gelegt hätte.",
    "answers": [
      {
        "targetId": "steffanFix",
        "lockedIf": {
          "condition": "evalTargetAnswerCountSmallerThan",
          "evalTargetId": "steffanMain",
          "data": 1
        },
        "removeAnswers": "sophieMain"
      },
      {
        "targetId": "ende",
        "lockedIf": {
          "condition": "evalTargetAnswerCountGreaterThan",
          "evalTargetId": "steffanMain",
          "data": 0
        }
      }
    ],
    "root": false,
    "unlockKeys": []
  },
  {
    "id": "steffanMain",
    "delay": 23,
    "text": "Wonach soll ich Steffan fragen?",
    "answers": [
      {
        "text": "Stell doch lieber eine Frage an Sophie Farber",
        "targetId": "sophieMain",
        "lockedIf": {
          "condition": "evalTargetAnswerCountSmallerThan",
          "evalTargetId": "sophieMain",
          "data": 1
        }
      },
      {
        "text": "Diese E-Mail Sache klingt interessant. Frag da doch mal etwas nach.",
        "targetId": "steffanEmail"
      }
    ],
    "root": false,
    "unlockKeys": []
  },
  {
    "id": "steffanEmail",
    "delay": 12,
    "text": "In der E-Mail ging es anscheinend um einige größere Investments die momentan anstehen. Steffan und Markus haben unterschiedliche Standpunkte bezüglich der geplanten Ausgaben und Steffan hat Markus deshalb in einem Moment geistiger Abwesenheit eine wütende E-Mail geschrieben. Er sagt allerdigs, dass dieses Thema nicht wirklich so kritisch ist wie es in der E-Mail scheint. Die Investitionen wurden bereits getätigt und es hat dem Unternehmen bis jetzt nicht geschadet.",
    "answers": [
      {
        "text": "Größere Investments?",
        "targetId": "steffanInvest"
      }
    ],
    "root": false,
    "unlockKeys": []
  },
  {
    "id": "steffanInvest",
    "delay": 9,
    "text": "Es standen einige Investments bezüglich Forschungsprojekten an. Dazu mussten neue Labore gebaut und Maschinen eingekauft werden. Steffan und Markus waren sich dabei uneinig wie umfangreich diese Investments gestaltet werden sollten. Wenn man sich Steffan's Reaktion auf das Thema anschaut scheint es aber tatsächlich nicht so als wären die Außeinandersetzungen zu diesem Thema besonders schlimm gewesen.",
    "answers": [
      {
        "text": "Ich habe das Gefühl, dass er trotzdem etwas damit zu tun hat. Auch wenn wir die Droh-E-Mail nicht direkt ihm zuordnen können finde ich, dass es einen Versuch wert ist ihn mal damit zu konfrontieren und ihm die Brandstiftung zu unterstellen. Vielleicht zeigt er unter ein bisschen Stress ja ein paar interessante Reaktionen.",
        "targetId": "steffanAnwalt"
      }
    ],
    "root": false,
    "unlockKeys": []
  },
  {
    "id": "steffanAnwalt",
    "delay": 1,
    "text": "Deine Theorie hat nicht so gut funktioniert. Er sagt bei solch schwerwiegenden Unterstellungen möchte er ohne seinen Anwalt nicht weitersprechen. Das mag verdächtig erscheinen aber hilft uns leider so garnicht weiter. Ab jetzt werden wir wohl nichts nützliches mehr aus ihm heraus bekommen.",
    "answers": [
      {
        "targetId": "sophieFix",
        "lockedIf": {
          "condition": "evalTargetAnswerCountSmallerThan",
          "evalTargetId": "sophieMain",
          "data": 1
        },
        "removeAnswers": "steffanMain"
      },
      {
        "targetId": "ende",
        "lockedIf": {
          "condition": "evalTargetAnswerCountGreaterThan",
          "evalTargetId": "sophieMain",
          "data": 0
        }
      }
    ],
    "root": false,
    "unlockKeys": []
  },
  {
    "id": "telefonDaten",
    "delay": 0,
    "text": "Telefon daten // TODO",
    "answers": [
      {
        "text": "Ist das dein ernst? Ist dir langweilig oder so?",
        "targetId": "sorrii",
        "locked": true,
        "unlockKey": "imernst"
      }
    ],
    "root": true,
    "chatName": "IT-Forensik",
    "chatImage": "/images/detectivephone.png",
    "unlockKeys": ["telefon"]
  },
  {
    "id": "ende",
    "delay": 20,
    "text": "Haha, sehr gut! Du warst ziemlich gut. Ehrlich gesagt war das ein Fall der schon gelöst wurde. Ich dachte nur dass du im Kundensupport bestimmt super gelangweilt bist und dachte das wäre eine super Idee um deine Produktivität ein bisschen zu senken. 🤣\r\n\r\nDu bist sicherlich am tatsächlichen Ergebniss dieses Falls interessiert:\r\nDass Sophie Markus getötet hat hast du ja schon herausgefunden. Im laufe der Untersuchungen ist herausgekommen, dass Steffan Wagenar Gelder des Unternehmens veruntreut hat um Drogenhandel zu betreiben. Markus war kurz davor das herauszufinden und hatte bereits mit Steffan über Unstimmigkeiten in den Finanzen gesprochen. Steffan hat Panik bekommen und das Haus von Markus angezündet um die Akten zu vernichten die Markus mit nach hause genommen hatte. Laut eigener Aussage konnte er zu diesem Zeitpunkt nicht klar denken und hat nicht darüber nachgedacht, dass Personen im Haus sein könnten.",
    "answers": [],
    "root": false,
    "unlockKeys": [],
    "end": true
  },
  {
    "id": "ende1",
    "delay": 1,
    "text": "Ja natürlich.",
    "answers": [],
    "root": false,
    "unlockKeys": ["imernst"],
    "end": true
  },
  {
    "id": "sorrii",
    "delay": 1,
    "text": "Sorrí 😝",
    "answers": [],
    "root": false,
    "unlockKeys": ["imernst"],
    "end": true
  }
]